       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDREC02.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           COPY "SLVND02.cbl".
       DATA DIVISION.
       FILE SECTION.
           COPY "FDVND02.cbl".

       WORKING-STORAGE SECTION.
       01  WS-VENDOR-NUM-FIELD         PIC Z(5).
       77  WS-RECORD-EXISTING          PIC X.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "------------ADD NEW RECORD------------".
           PERFORM OPENING-PROCEDURE.
           PERFORM GET-NEW-VENDOR-NUMBER.
           PERFORM GET-NEW-RECORD
               UNTIL FS-VENDOR-NUMBER = ZEROS.
           PERFORM CLOSING-PROCEDURE.

       PROGRAM-END.
           GOBACK.
      *-----------------------------------------------------------------
       OPENING-PROCEDURE.
           OPEN I-O VENDOR-FILE-02.

       CLOSING-PROCEDURE.
           CLOSE VENDOR-FILE-02.

       GET-NEW-RECORD.
           PERFORM ADD-RECORD.

       GET-NEW-VENDOR-NUMBER.
           PERFORM INIT-VENDOR-RECORD.
           PERFORM ENTER-VENDOR-NUMBER.
           PERFORM FIND-NEW-RECORD.

       FIND-NEW-RECORD.
           PERFORM READ-AND-FIND.
           IF WS-RECORD-EXISTING = "Y"
               DISPLAY "----------------------------"
               DISPLAY "VENDOR NUMBER ALREADY ON FILE"
               DISPLAY "----------------------------"
               PERFORM GET-NEW-VENDOR-NUMBER.

       READ-AND-FIND.
           READ VENDOR-FILE-02 RECORD
               INVALID KEY
                   MOVE "N" TO WS-RECORD-EXISTING.

       INIT-VENDOR-RECORD.
           MOVE SPACE TO VENDOR-RECORD.
           MOVE ZEROES TO FS-VENDOR-NUMBER.
           MOVE "Y" TO WS-RECORD-EXISTING.

       ENTER-VENDOR-NUMBER.
           DISPLAY "ENTER VENDOR NUMBER (1 - 99999)".
           DISPLAY "ENTER 0 TO STOP ENTRY".
           ACCEPT WS-VENDOR-NUM-FIELD.
           MOVE WS-VENDOR-NUM-FIELD TO FS-VENDOR-NUMBER.

       ADD-RECORD.
           PERFORM ENTER-VENDOR-FIELD.
           PERFORM WRITE-RECORD.
           PERFORM GET-NEW-VENDOR-NUMBER.

       WRITE-RECORD.
           WRITE VENDOR-RECORD.

       ENTER-VENDOR-FIELD.
           PERFORM ENTER-VENDOR-NAME.
           PERFORM ENTER-VENDOR-ADDRESS1.
           PERFORM ENTER-VENDOR-ADDRESS2.
           PERFORM ENTER-VENDOR-CITY.
           PERFORM ENTER-VENDOR-STATE.
           PERFORM ENTER-VENDOR-ZIP.
           PERFORM ENTER-VENDOR-CONTACT.
           PERFORM ENTER-VENDOR-PHONE.

       ENTER-VENDOR-NAME.
           DISPLAY "ENTER VENDOR NAME".
           ACCEPT FS-VENDOR-NAME.

       ENTER-VENDOR-ADDRESS1.
           DISPLAY "ENTER VENDOR ADDRESS 1".
           ACCEPT FS-VENDOR-ADDRESS1.

       ENTER-VENDOR-ADDRESS2.
           DISPLAY "ENTER VENDOR ADDRESS 2".
           ACCEPT FS-VENDOR-ADDRESS2.

       ENTER-VENDOR-CITY.
           DISPLAY "ENTER VENDOR CITY".
           ACCEPT FS-VENDOR-CITY.

       ENTER-VENDOR-STATE.
           DISPLAY "ENTER VENDOR STATE".
           ACCEPT FS-VENDOR-STATE.

       ENTER-VENDOR-ZIP.
           DISPLAY "ENTER VENDOR ZIP".
           ACCEPT FS-VENDOR-ZIP.

       ENTER-VENDOR-CONTACT.
           DISPLAY "ENTER VENDOR CONTACT".
           ACCEPT FS-VENDOR-CONTACT.

       ENTER-VENDOR-PHONE.
           DISPLAY "ENTER VENDOR PHONE".
           ACCEPT FS-VENDOR-PHONE.
