      ******************************************************************
      *    FDVND02.CBL FD
      ******************************************************************
       FD  VENDOR-FILE-02.
       01  VENDOR-RECORD.
           05  FS-VENDOR-NUMBER        PIC 9(5).
           05  FS-VENDOR-NAME          PIC X(30).
           05  FS-VENDOR-ADDRESS1      PIC X(30).
           05  FS-VENDOR-ADDRESS2      PIC X(30).
           05  FS-VENDOR-CITY          PIC X(20).
           05  FS-VENDOR-STATE         PIC X(2).
           05  FS-VENDOR-ZIP           PIC X(10).
           05  FS-VENDOR-CONTACT       PIC X(30).
           05  FS-VENDOR-PHONE         PIC X(15).
