       IDENTIFICATION DIVISION.
       PROGRAM-ID. INQREC02.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           COPY "SLVND02.cbl".
       DATA DIVISION.
       FILE SECTION.
           COPY "FDVND02.cbl".

       WORKING-STORAGE SECTION.
       77  WS-VENDOR-NUM-FIELD         PIC Z(5).
       77  WS-RECORD-FOUND             PIC X.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "------------INQUIRY RECORD------------".
           PERFORM OPENING-PROCEDURE.
           PERFORM GET-NEW-VENDOR-NUMBER.
           PERFORM FIND-RECORD
               UNTIL FS-VENDOR-NUMBER = ZEROS.
           PERFORM CLOSING-PROCEDURE.
       PROGRAM-END.
           GOBACK.
      *-----------------------------------------------------------------
       OPENING-PROCEDURE.
           OPEN I-O VENDOR-FILE-02.

       CLOSING-PROCEDURE.
           CLOSE VENDOR-FILE-02.

       GET-NEW-VENDOR-NUMBER.
           PERFORM INIT-VENDOR-RECORD.
           PERFORM ENTER-VENDOR-NUMBER.

       INIT-VENDOR-RECORD.
           MOVE SPACE TO VENDOR-RECORD.
           MOVE ZEROES TO FS-VENDOR-NUMBER.

       ENTER-VENDOR-NUMBER.
           DISPLAY "ENTER VENDOR NUMBER (1 - 99999)".
           DISPLAY "ENTER 0 TO STOP INQUIRY".
           ACCEPT WS-VENDOR-NUM-FIELD.
           MOVE WS-VENDOR-NUM-FIELD TO FS-VENDOR-NUMBER.

       FIND-RECORD.
           PERFORM READ-AND-FIND.
           IF WS-RECORD-FOUND = "Y"
               PERFORM DISPLAY-RECORD-FOUND
           ELSE
               DISPLAY "RECORD NOT FOUND".
           PERFORM GET-NEW-VENDOR-NUMBER.

       READ-AND-FIND.
           MOVE "Y" TO WS-RECORD-FOUND.
           READ VENDOR-FILE-02 RECORD
               INVALID KEY
                   MOVE "N" TO WS-RECORD-FOUND.

       DISPLAY-RECORD-FOUND.
           DISPLAY "  ".
           DISPLAY "VENDOR NUMBER: " FS-VENDOR-NUMBER.
           DISPLAY "1) VENDOR NAME:" FS-VENDOR-NAME.
           DISPLAY "2) VENDOR ADDRESS 1:" FS-VENDOR-ADDRESS1.
           DISPLAY "3) VENDOR ADDRESS 2:" FS-VENDOR-ADDRESS2.
           DISPLAY "4) VENDOR CITY:" FS-VENDOR-CITY.
           DISPLAY "5) VENDOR STATE:" FS-VENDOR-STATE.
           DISPLAY "6) VENDOR ZIP:" FS-VENDOR-ZIP.
           DISPLAY "7) VENDOR CONTACT:" FS-VENDOR-CONTACT.
           DISPLAY "8) VENDOR PHONE:" FS-VENDOR-PHONE.
           DISPLAY "  ".
